Optimizing sales for specialty food distributor - data-driven insights with SQL
===
---

In [1]:
# ? imports and settings

---
# Executive summary

---
# Input data and transformations

Data and database schema is available [here](https://github.com/pthom/northwind_psql/tree/master). We use this data to create a `northwind` database on a PostgreSQL server. First, we install relevant packages to interact with the database.

In [2]:
!pip install ipython-sql
!pip install python-decouple
# !pip install psycopg2 # Python integration

%load_ext sql

Requirement already satisfied: ipython-sql in c:\users\malec\anaconda3\lib\site-packages (0.5.0)
Requirement already satisfied: prettytable in c:\users\malec\anaconda3\lib\site-packages (from ipython-sql) (3.10.0)
Requirement already satisfied: ipython in c:\users\malec\anaconda3\lib\site-packages (from ipython-sql) (8.15.0)
Requirement already satisfied: sqlalchemy>=2.0 in c:\users\malec\anaconda3\lib\site-packages (from ipython-sql) (2.0.28)
Requirement already satisfied: sqlparse in c:\users\malec\anaconda3\lib\site-packages (from ipython-sql) (0.4.4)
Requirement already satisfied: six in c:\users\malec\anaconda3\lib\site-packages (from ipython-sql) (1.16.0)
Requirement already satisfied: ipython-genutils in c:\users\malec\anaconda3\lib\site-packages (from ipython-sql) (0.2.0)
Requirement already satisfied: typing-extensions>=4.6.0 in c:\users\malec\anaconda3\lib\site-packages (from sqlalchemy>=2.0->ipython-sql) (4.7.1)
Requirement already satisfied: greenlet!=0.4.17 in c:\users\malec\anaconda3\lib\site-packages (from sqlalchemy>=2.0->ipython-sql) (2.0.1)
Requirement already satisfied: backcall in c:\users\malec\anaconda3\lib\site-packages (from ipython->ipython-sql) (0.2.0)
Requirement already satisfied: decorator in c:\users\malec\anaconda3\lib\site-packages (from ipython->ipython-sql) (5.1.1)
Requirement already satisfied: jedi>=0.16 in c:\users\malec\anaconda3\lib\site-packages (from ipython->ipython-sql) (0.18.1)
Requirement already satisfied: matplotlib-inline in c:\users\malec\anaconda3\lib\site-packages (from ipython->ipython-sql) (0.1.6)
Requirement already satisfied: pickleshare in c:\users\malec\anaconda3\lib\site-packages (from ipython->ipython-sql) (0.7.5)
Requirement already satisfied: prompt-toolkit!=3.0.37,<3.1.0,>=3.0.30 in c:\users\malec\anaconda3\lib\site-packages (from ipython->ipython-sql) (3.0.36)
Requirement already satisfied: pygments>=2.4.0 in c:\users\malec\anaconda3\lib\site-packages (from ipython->ipython-sql) (2.15.1)
Requirement already satisfied: stack-data in c:\users\malec\anaconda3\lib\site-packages (from ipython->ipython-sql) (0.2.0)
Requirement already satisfied: traitlets>=5 in c:\users\malec\anaconda3\lib\site-packages (from ipython->ipython-sql) (5.7.1)
Requirement already satisfied: colorama in c:\users\malec\anaconda3\lib\site-packages (from ipython->ipython-sql) (0.4.6)
Requirement already satisfied: wcwidth in c:\users\malec\anaconda3\lib\site-packages (from prettytable->ipython-sql) (0.2.5)
Requirement already satisfied: parso<0.9.0,>=0.8.0 in c:\users\malec\anaconda3\lib\site-packages (from jedi>=0.16->ipython->ipython-sql) (0.8.3)
Requirement already satisfied: executing in c:\users\malec\anaconda3\lib\site-packages (from stack-data->ipython->ipython-sql) (0.8.3)
Requirement already satisfied: asttokens in c:\users\malec\anaconda3\lib\site-packages (from stack-data->ipython->ipython-sql) (2.0.5)
Requirement already satisfied: pure-eval in c:\users\malec\anaconda3\lib\site-packages (from stack-data->ipython->ipython-sql) (0.2.2)
Requirement already satisfied: python-decouple in c:\users\malec\anaconda3\lib\site-packages (3.8)

Now we connect to the database.

In [3]:
from decouple import config

%sql postgresql://postgres:{config('PASSWORD')}@localhost:5432/northwind

We explore the database schema and create some basic views.

In [4]:
%%sql
SELECT
	table_name AS name,
	table_type AS type 
FROM
	information_schema.tables 
WHERE
	table_schema = 'public' 
	AND table_type IN 
	(
		'BASE TABLE',
		'VIEW' 
	)
;

 * postgresql://postgres:***@localhost:5432/northwind
17 rows affected.

[('territories', 'BASE TABLE'),
 ('order_details', 'BASE TABLE'),
 ('employee_territories', 'BASE TABLE'),
 ('us_states', 'BASE TABLE'),
 ('customers', 'BASE TABLE'),
 ('orders', 'BASE TABLE'),
 ('employees', 'BASE TABLE'),
 ('shippers', 'BASE TABLE'),
 ('products', 'BASE TABLE'),
 ('categories', 'BASE TABLE'),
 ('suppliers', 'BASE TABLE'),
 ('region', 'BASE TABLE'),
 ('customer_demographics', 'BASE TABLE'),
 ('customer_customer_demo', 'BASE TABLE'),
 ('view_orders_customers', 'VIEW'),
 ('view_orders_details', 'VIEW'),
 ('view_employees_orders', 'VIEW')]

In [5]:
%%sql
CREATE VIEW view_orders_customers AS 
SELECT
	orders.*,
	c.company_name,
	c.contact_name,
	c.contact_title,
	c.address,
	c.city,
	c.region,
	c.postal_code,
	c.country,
	c.phone,
	c.fax 
FROM
	orders 
	LEFT JOIN
		customers AS c 
		ON orders.customer_id = c.customer_id;

 * postgresql://postgres:***@localhost:5432/northwind
(psycopg2.errors.DuplicateTable) relation "view_orders_customers" already exists

[SQL: CREATE VIEW view_orders_customers AS
SELECT
	orders.*,
	c.company_name,
	c.contact_name,
	c.contact_title,
	c.address,
	c.city,
	c.region,
	c.postal_code,
	c.country,
	c.phone,
	c.fax
FROM
	orders
	LEFT JOIN
		customers AS c
		ON orders.customer_id = c.customer_id;]
(Background on this error at: https://sqlalche.me/e/20/f405)

In [6]:
%%sql
CREATE VIEW view_orders_details AS 
SELECT
	order_details.*,
	p.product_name,
	o.customer_id,
	o.ship_name,
	o.ship_city,
	o.ship_country 
FROM
	order_details 
	LEFT JOIN
		products AS p 
		ON order_details.product_id = p.product_id 
	LEFT JOIN
		orders AS o 
		ON order_details.order_id = o.order_id;

 * postgresql://postgres:***@localhost:5432/northwind
(psycopg2.errors.DuplicateTable) relation "view_orders_details" already exists

[SQL: CREATE VIEW view_orders_details AS
SELECT
	order_details.*,
	p.product_name,
	o.customer_id,
	o.ship_name,
	o.ship_city,
	o.ship_country
FROM
	order_details
	LEFT JOIN
		products AS p
		ON order_details.product_id = p.product_id
	LEFT JOIN
		orders AS o
		ON order_details.order_id = o.order_id;]
(Background on this error at: https://sqlalche.me/e/20/f405)

In [7]:
%%sql
CREATE VIEW view_employees_orders AS 
SELECT
	e.employee_id,
	e.last_name,
	e.first_name,
	e.title,
	e.hire_date,
	e.birth_date,
	e.country,
	o.order_id,
	o.customer_id 
FROM
	employees AS e 
	LEFT JOIN
		orders AS o 
		ON e.employee_id = o.employee_id

 * postgresql://postgres:***@localhost:5432/northwind
(psycopg2.errors.DuplicateTable) relation "view_employees_orders" already exists

[SQL: CREATE VIEW view_employees_orders AS
SELECT
	e.employee_id,
	e.last_name,
	e.first_name,
	e.title,
	e.hire_date,
	e.birth_date,
	e.country,
	o.order_id,
	o.customer_id
FROM
	employees AS e
	LEFT JOIN
		orders AS o
		ON e.employee_id = o.employee_id]
(Background on this error at: https://sqlalche.me/e/20/f405)

In [8]:
%sql SELECT * FROM view_orders_customers LIMIT 5;

 * postgresql://postgres:***@localhost:5432/northwind
5 rows affected.

[(10248, 'VINET', 5, datetime.date(1996, 7, 4), datetime.date(1996, 8, 1), datetime.date(1996, 7, 16), 3, 32.38, 'Vins et alcools Chevalier', "59 rue de l'Abbaye", 'Reims', None, '51100', 'France', 'Vins et alcools Chevalier', 'Paul Henriot', 'Accounting Manager', "59 rue de l'Abbaye", 'Reims', None, '51100', 'France', '26.47.15.10', '26.47.15.11'),
 (10249, 'TOMSP', 6, datetime.date(1996, 7, 5), datetime.date(1996, 8, 16), datetime.date(1996, 7, 10), 1, 11.61, 'Toms Spezialitäten', 'Luisenstr. 48', 'Münster', None, '44087', 'Germany', 'Toms Spezialitäten', 'Karin Josephs', 'Marketing Manager', 'Luisenstr. 48', 'Münster', None, '44087', 'Germany', '0251-031259', '0251-035695'),
 (10250, 'HANAR', 4, datetime.date(1996, 7, 8), datetime.date(1996, 8, 5), datetime.date(1996, 7, 12), 2, 65.83, 'Hanari Carnes', 'Rua do Paço, 67', 'Rio de Janeiro', 'RJ', '05454-876', 'Brazil', 'Hanari Carnes', 'Mario Pontes', 'Accounting Manager', 'Rua do Paço, 67', 'Rio de Janeiro', 'RJ', '05454-876', 'Brazil', '(21) 555-0091', '(21) 555-8765'),
 (10251, 'VICTE', 3, datetime.date(1996, 7, 8), datetime.date(1996, 8, 5), datetime.date(1996, 7, 15), 1, 41.34, 'Victuailles en stock', '2, rue du Commerce', 'Lyon', None, '69004', 'France', 'Victuailles en stock', 'Mary Saveley', 'Sales Agent', '2, rue du Commerce', 'Lyon', None, '69004', 'France', '78.32.54.86', '78.32.54.87'),
 (10252, 'SUPRD', 4, datetime.date(1996, 7, 9), datetime.date(1996, 8, 6), datetime.date(1996, 7, 11), 2, 51.3, 'Suprêmes délices', 'Boulevard Tirou, 255', 'Charleroi', None, 'B-6000', 'Belgium', 'Suprêmes délices', 'Pascale Cartrain', 'Accounting Manager', 'Boulevard Tirou, 255', 'Charleroi', None, 'B-6000', 'Belgium', '(071) 23 67 22 20', '(071) 23 67 22 21')]

In [9]:
%sql SELECT * FROM view_orders_details LIMIT 5;

 * postgresql://postgres:***@localhost:5432/northwind
5 rows affected.

[(10248, 11, 14.0, 12, 0.0, 'Queso Cabrales', 'VINET', 'Vins et alcools Chevalier', 'Reims', 'France'),
 (10248, 42, 9.8, 10, 0.0, 'Singaporean Hokkien Fried Mee', 'VINET', 'Vins et alcools Chevalier', 'Reims', 'France'),
 (10248, 72, 34.8, 5, 0.0, 'Mozzarella di Giovanni', 'VINET', 'Vins et alcools Chevalier', 'Reims', 'France'),
 (10249, 14, 18.6, 9, 0.0, 'Tofu', 'TOMSP', 'Toms Spezialitäten', 'Münster', 'Germany'),
 (10249, 51, 42.4, 40, 0.0, 'Manjimup Dried Apples', 'TOMSP', 'Toms Spezialitäten', 'Münster', 'Germany')]

In [10]:
%sql SELECT * FROM view_employees_orders LIMIT 5;

 * postgresql://postgres:***@localhost:5432/northwind
5 rows affected.

[(1, 'Davolio', 'Nancy', 'Sales Representative', datetime.date(1992, 5, 1), datetime.date(1948, 12, 8), 'USA', 10258, 'ERNSH'),
 (1, 'Davolio', 'Nancy', 'Sales Representative', datetime.date(1992, 5, 1), datetime.date(1948, 12, 8), 'USA', 10270, 'WARTH'),
 (1, 'Davolio', 'Nancy', 'Sales Representative', datetime.date(1992, 5, 1), datetime.date(1948, 12, 8), 'USA', 10275, 'MAGAA'),
 (1, 'Davolio', 'Nancy', 'Sales Representative', datetime.date(1992, 5, 1), datetime.date(1948, 12, 8), 'USA', 10285, 'QUICK'),
 (1, 'Davolio', 'Nancy', 'Sales Representative', datetime.date(1992, 5, 1), datetime.date(1948, 12, 8), 'USA', 10292, 'TRADH')]

---
# Data analysis

Rank employees based on their total sales.

In [11]:
%%sql
WITH total_sales_per_employee AS 
(
	SELECT
		o.employee_id,
		SUM(d.unit_price * d.quantity * (1 - d.discount)) AS "Total sales" 
	FROM
		order_details AS d 
		LEFT JOIN
			orders AS o 
			ON d.order_id = o.order_id 
	GROUP BY
		o.employee_id 
)
SELECT
	RANK() OVER (ORDER BY "Total sales" DESC) AS "Employee rank",
	total_sales_per_employee.employee_id 
FROM
	total_sales_per_employee LIMIT 10;

 * postgresql://postgres:***@localhost:5432/northwind
9 rows affected.

[(1, 4), (2, 3), (3, 1), (4, 2), (5, 8), (6, 7), (7, 9), (8, 6), (9, 5)]

---
# Findings

---
# Conclusions